import { cn } from "@/utils";

export default function Empty(props: { className?: string; title?: string }) {
  return (
    <div
      className={cn(
        "flex justify-center items-center flex-col pt-30 pb-50 w-full",
        props.className
      )}
    >
      <div>
        <svg
          viewBox="0 0 80 80"
          width="24"
          height="24"
          className="w-20 h-20"
        >
          <rect width="80" height="80" fill="none" rx="0"></rect>
          <rect
            width="20"
            height="14"
            x="15"
            y="21"
            fill="#EDEDED"
            rx="4"
          ></rect>
          <rect
            width="20"
            height="14"
            x="44"
            y="21"
            fill="#EDEDED"
            rx="4"
          ></rect>
          <rect
            width="49"
            height="14"
            x="15"
            y="45"
            fill="#EDEDED"
            rx="4"
          ></rect>
          <path
            fill="#CCC"
            d="M38.665 31v2q0 1.191-.571 2.237l-1.167-.638q.408-.747.408-1.599v-2h1.33Zm-4.353 6.655q-.156.01-.312.01h-3.727v-1.33H34q.112 0 .223-.007l.089 1.327Zm-8.039.01h-4v-1.33h4v1.33Zm-8.022-1.89q-.916-1.236-.916-2.775v-1.454h1.33V33q0 1.1.655 1.984l-1.07.792Zm-.916-8.229v-4h1.33v4h-1.33Zm1.64-8.097q1.307-1.114 3.025-1.114h1.18v1.33H22q-1.228 0-2.163.796l-.862-1.012Zm8.206-1.114h4v1.33h-4v-1.33Zm8.173.2q1.145.348 1.981 1.203.837.855 1.158 2.008l-1.28.357q-.23-.823-.829-1.435-.598-.611-1.416-.86l.386-1.272ZM38.665 23v4h-1.33v-4h1.33ZM60.665 55v2q0 1.191-.571 2.237l-1.167-.638q.408-.747.408-1.599v-2h1.33Zm-4.353 6.655q-.156.01-.312.01h-3.727v-1.33H56q.112 0 .223-.007l.089 1.327Zm-8.039.01h-4v-1.33h4v1.33Zm-8 0h-4v-1.33h4v1.33Zm-8 0h-4v-1.33h4v1.33Zm-8 0H22q-1.023 0-1.952-.428l.557-1.208q.664.306 1.395.306h2.273v1.33Zm-6.895-4.034q-.043-.314-.043-.631v-3.454h1.33V57q0 .226.03.45l-1.317.18Zm-.043-8.085V47q0-.858.305-1.66l1.243.473q-.218.574-.218 1.187v2.546h-1.33Zm3.717-7.114q.47-.097.948-.097h3.18v1.33H22q-.342 0-.677.07l-.27-1.303Zm8.129-.097h4v1.33h-4v-1.33Zm8 0h4v1.33h-4v-1.33Zm8 0h4v1.33h-4v-1.33Zm8 0H56q.692 0 1.354.2l-.386 1.274q-.473-.144-.968-.144h-2.82v-1.33Zm7.312 3.41q.172.616.172 1.255v4h-1.33v-4q0-.457-.123-.897l1.281-.357Z"
          ></path>
        </svg>
      </div>
      <div className="text-lg font-medium pt-3">
        {props.title ?? "暂无数据"}
      </div>
    </div>
  );
}
